_GaryText_760f4:: ; 860e1 (21:60e1)
	text $53, ": היי!"

	para "בדיוק רציתי"
	line "לפגוש"
	cont "אותך, ", $52, "!"

	para "היריב שלי"
	line "צריך להיות חזק"
	cont "כדי שאני אשאר חזק"

	para "בזמן שעבדתי על"
	line "ה#ידע, חיפשתי "
	cont "בכל מקום"
	cont "מון חזק#"

	para "לא רק זה! אני"
	line "הרכבתי קבוצה"
	cont "שיכולה להביס"
	cont "כל סוג #ימון!"

	para "ועכשיו!"

	para "אני אלוף"
	line "ליגת ה#ימונים!"

	para $52, "! אתה יודע"
	line "מה השם הזה"
	cont "אומר?"

	para "אני אומר לך!"

	para "אני המאמן"
	line "הכי חזק"
	cont "בעולם!"
	done

_GaryText_760f9:: ; 8623b (21:623b)
	text "לא!"
	line "זה לא יכול להיות!"
	cont "ניצחת אותי בכל העוצמתי!"

	para "אחרי כל"
	line "העבודה להיות"
	cont "אלוף הפוקימונים?"

	para "תקופתי תמה"
	line "כבר?"
	cont "זה לא פייר!"
	prompt

_GaryText_760fe:: ; 862b4 (21:62b4)
	text "חהחהחה!"
	line "ניצחתי, ניצחתי!"

	para "אני יותר מדי טוב"
	line "לך, ", $52, "!"

	para "עשית יפה"
	line "בכלל להגיע אלי,"
	cont $53, ", גאון"
	cont "ה#ימונים!"

	para "נסיון יפה, לוזר!"
	line "חהחהחה!"
	prompt

_GaryText_76103:: ; 8632f (21:632f)
	text "למה?"
	line "למה הפסדתי?"

	para "לעולם לא"
	line "טעיתי בגידול"
	cont "ה#ימונים שלי..."

	para "אוף, אתה"
	line "אלוף ליגת"
	cont "ה#ימונים!"

	para "למרות שאני לא"
	line "אוהב להודות בזה."
	done

_GaryText2:: ; 863c1 (21:63c1)
	text "אלון: ", $52, "!"
	done

_GaryText_76120:: ; 863ca (21:63ca)
	text "אלון: אז, אתה ניצחת!"
	line "מזל טוב!"
	cont "אתה אלוף"
	cont "ליגת"
	cont "ה#ימונים!"

	para "אתה גדלת כל כך"
	line "הרבה מאז"
	cont "שהלכת עם"
	cont "@"
	TX_RAM wcd6d
	text "!"

	para $52, ", אתה"
	line "ממש התבגרת!"
	done

_GaryText_76125:: ; 86463 (21:6463)
	text "אלון: ", $53, "! אני"
	line "התאכזבתי!"

	para "אני באתי ברגע"
	line "ששמעתי שהבסת"
	cont "את הרבעייה העילית!"

	para "אבל, כשהגעתי"
	line "לכאן, אתה"
	cont "כבר הפסדת!"

	para $53, "! אתה"
	line "הבנת למה"
	cont "הפסדת?"

	para "אתה שכחת"
	line "להפגין"
	cont "ל#ימונים שלך"
	cont "אמון ואהבה!"

	para "בלי אלה, אתה"
	line "בחיים לא תיהיה"
	cont "אלוף שוב!"
	done

_GaryText_7612a:: ; 86567 (21:6567)
	text "אלון: ", $52, "!"

	para "אתה מבין"
	line "שהניצחון שלך"
	cont "לא היה רק"
	cont "שלך!"

	para "הקשר שאתה חולק"
	line "עם ה#ימונים שלך"
	cont "הוא אדיר!"

	para $52, "!"
	line "בוא איתי!"
	done

